/* `welcomeLabel` UILabel text default value */
"Welcome" = "ยินดีต้อนรับ";

/* `thankyouLabel` UILabel text default value */
"ThankyouMessage" = "ขอบคุณสำหรับการดาวน์โหลด";

/* `instructionTextView` UITextView text default value with \".notConfigurated\" state */
"WelcomeInstruction" = "กรุณาทำตามคำแนะนำที่คุณได้รับในอีเมล์ต้อนรับเพื่อเริ่มต้นกระบวนการเปิดใช้งาน";

/* `instructionTextView` UITextView text default value with \".isConfigured\" state */
"ConfiguredInstruction" = "ควบคุมการจัดการงานประจำวันของคุณและทำงานร่วมกันในโครงการได้อย่างง่ายดาย";

"ScanInstruction" = "กรุณาสแกนรหัส QR ที่ปลอดภัยเพื่อเริ่มต้นกระบวนการเปิดใช้งาน";

"DiscoveryServiceInstruction" = "กรุณาป้อนอีเมล์แอดเดรสเพื่อเริ่มต้นกระบวนการเปิดใช้งาน";

/* checking the account(email address) user entered in discovery service */
"CheckingAccountKey" = "กำลังตรวจสอบบัญชี...";

/* `signInButton` UIButton's titleLabel?.text default value */
"SignIn" = "เริ่มต้น";

"Scan" = "สแกน";

/* `demoLabel` UILabel text default value */
"Explore" = "ต้องการสำรวจใช่หรือไม่?";

/* `demoButton` UIButton's titleLabel?.text default value */
"TryDemo" = "ลองใช้การสาธิต";

/* The title for the passcode setup screens. */
"SetPasscodeKey" = "กำหนดรหัสผ่านอุปกรณ์";

/* The title for the enter passcode screen. */
"PasscodeKey" = "รหัสผ่านอุปกรณ์";

/* The title for the Choose Passcode screen. */
"ChoosePasscodeTitleKey" = "เลือกรหัสผ่านอุปกรณ์";

/* The title for the Confirm Passcode screen. */
"ConfirmPasscodeTitleKey" = "ยืนยันรหัสผ่านอุปกรณ์";

/* The message on the confirm passcode screen for passcode setup. */
"EnterPasscodeAgainKey" = "ป้อนรหัสผ่านอุปกรณ์ของคุณอีกครั้ง";

/* The message on the confirm passcode screen for passcode change. */
"ConfirmPasscodeKey" = "ยืนยันรหัสผ่านอุปกรณ์ของคุณ";

/* The message on the input passcode screen. */
"EnterYourPasscodeKey" = "ป้อนรหัสผ่านอุปกรณ์ของคุณ";

/* The title for the passcode change screens. */
"ChangePasscodeKey" = "เปลี่ยนรหัสผ่านอุปกรณ์";

/* The message on the input passcode screen in change passcode. */
"EnterYourCurrentPasscodeKey" = "ป้อนรหัสผ่านอุปกรณ์ปัจจุบันของคุณ";

/* The button title string used both in passcode and\n touch ID screens to indicate not to setup now. */
"NotNowKey" = "ภายหลัง";

/* The button title string used on the second passcode setup\n to go back to the first screen. */
"BackKey" = "ย้อนกลับ";

/* The button title string used on the first passcode setup\n to go to the next screen. */
"NextKey" = "ถัดไป";

/* The button title string used on the passcode input screen (not in the change passcode sequence)\n When the passcode input screen is in the change passcode sequence, the button title should be changed \"Next\" */
"DoneKey" = "เสร็จสิ้น";

/* The main message format on the setup passscode screen.\n The %d will display the number of characters required from\n the passcode policy. */
"PasscodeChooseMinCharKey" = "เลือกรหัสผ่านอุปกรณ์ที่มีอย่างน้อย %d อักขระเพื่อปลดล็อคแอพ";

/* The main message format on the setup passscode screen when the\n isDititsOnly property of the passcode policy is true.\n The %d will display the number of digits required from\n the passcode policy. */
"PasscodeChooseMinDigitKey" = "เลือกรหัสผ่านอุปกรณ์ที่มีอย่างน้อย %d หลักเพื่อปลดล็อคแอพ";

/* The message for passcode to include the required character groups\n when passcode policy requires it. */
"PasscodeRequiredGroupKey" = "รวมถึงสิ่งต่อไปนี้";

/* The group name for lower case letters. */
"LowerCaseKey" = "ตัวพิมพ์เล็ก (a-z)";

/* The group name for upper case letters. */
"UpperCaseKey" = "ตัวพิมพ์ใหญ่ (A-Z)";

/* The group name for digits. */
"DigitsKey" = "ตัวเลข (0–9)";

/* The group name for non-alphabetic characters. */
"Non-alphaKey" = "สัญลักษณ์ (!@#...)";

/* The button title for resetting passcode. */
"ResetPasscodeKey" = "รีเซ็ตรหัสผ่านอุปกรณ์";

/* Alert message when validate method of FUIPasscodeValidationDelegate\n returning false for the passcode user entered in setup passcode. */
"PasscodeValidationFailedKey" = "การตรวจสอบความถูกต้องของรหัสผ่านอุปกรณ์ล้มเหลว";

/* Alert message when the passcode user entered was rejected by\n the FUIPasscodeControllerDelegate's shouldTryPasscode function. */
"PasscodeRejectedKey" = "รหัสผ่านอุปกรณ์ถูกปฏิเสธโดย FUIPasscodeControllerDelegate";

/* The alert button title used on passcode validation failed, or passcode rejected. */
"RetryKey" = "ลองใหม่";

/* The title for setup touch ID screen. */
"TouchIDKey" = "Touch ID";

/* The title for setup touch ID screen. */
"FaceIDKey" = "Face ID";

/* This is to be used combined with \"Touch ID\" or \"Face ID\", e.g., \"Touch ID is now available!\" */
"IsNowAvailableKey" = " พร้อมใช้งานแล้ว!";

/* The first paragraph of the message on the Touch ID screen when no Touch ID is enrolled on device. */
"TouchIDMessage1Key" = "การเปิดใช้งาน Touch ID จะทำให้คุณเข้าถึงข้อมูลของคุณได้รวดเร็วยิ่งขึ้น";

/* The second paragraph of the message on the Touch ID screen when no Touch ID is enrolled on device. */
"TouchIDMessage2Key" = "คุณสามารถเปิดหรือปิดฟีเจอร์นี้ได้ทุกเมื่อจากการกำหนดค่า";

/* The first paragraph of the message on the Touch ID screen when Touch ID is enrolled on device. */
"TouchIDEnableMessage1Key" = "กรุณาเปิดใช้งาน Touch ID เพื่อการเข้าถึงที่ปลอดภัยและรวดเร็ว";

/* The second paragraph of the message on the Touch ID screen when Touch ID is enrolled on device. */
"TouchIDEnableMessage2Key" = "ถ้า Touch ID ถูกปิดใช้งาน คุณจะถูกขอให้รหัสผ่านอุปกรณ์ของคุณ";

/* The first paragraph of the message on the Face ID screen when no Touch ID is enrolled on device. */
"FaceIDMessage1Key" = "การเปิดใช้งาน Face ID จะทำให้คุณเข้าถึงข้อมูลของคุณได้รวดเร็วยิ่งขึ้น";

/* The second paragraph of the message on the Face ID screen when no Touch ID is enrolled on device. */
"FaceIDMessage2Key" = "คุณสามารถเปิดหรือปิดฟีเจอร์นี้ได้ทุกเมื่อจากการกำหนดค่า";

/* The first paragraph of the message on the Face ID screen when Touch ID is enrolled on device. */
"FaceIDEnableMessage1Key" = "กรุณาเปิดใช้งาน Face ID เพื่อการเข้าถึงที่ปลอดภัยและรวดเร็ว";

/* The second paragraph of the message on the Face ID screen when Touch ID is enrolled on device. */
"FaceIDEnableMessage2Key" = "ถ้า Face ID ถูกปิดใช้งาน คุณจะถูกขอให้รหัสผ่านอุปกรณ์ของคุณ";

/* The alert title to ask user add fingerprints to use Touch ID. */
"UseTouchIDTitleKey" = "เมื่อต้องการใช้ Touch ID กรุณาเพิ่มลายนิ้วมือในการกำหนดค่าอุปกรณ์ของคุณ";

/* The alert message to ask user add fingerprints to use Touch ID. */
"UseTouchIDMessageKey" = "คุณสามารถดำเนินการนี้ได้ทุกเมื่อในการกำหนดค่า - Touch ID และรหัสผ่านอุปกรณ์";

/* The alert title to ask user add fingerprints to use Face ID. */
"UseFaceIDTitleKey" = "เมื่อต้องการใช้ Face ID กรุณาลงทะเบียน Face ID ในการกำหนดค่าอุปกรณ์ของคุณ";

/* The alert message to ask user add fingerprints to use Face ID. */
"UseFaceIDMessageKey" = "คุณสามารถดำเนินการนี้ได้ทุกเมื่อในการกำหนดค่า - Face ID และรหัสผ่านอุปกรณ์";

/* The message for the link on the Touch ID screen. */
"LearnMoreKey" = "เรียนรู้เพิ่มเติมเกี่ยวกับ Touch ID";

/* The message for the link on the Face ID screen. */
"LearnMoreFaceIDKey" = "เรียนรู้เพิ่มเติมเกี่ยวกับ Face ID";

/* The button title to enable Touch ID authentication. */
"EnableKey" = "เปิดใช้งาน";

/* The message displayed when authticate with Touch ID. */
"AuthWithTouchIDKey" = "รับรองความถูกต้องด้วย Touch ID";

/* The message displayed when authticate with Face ID. */
"AuthWithFaceIDKey" = "รับรองความถูกต้องด้วย Face ID";

/* The title on the navigation bar. */
"TouchIDErrorNavigationTitleKey" = "ข้อผิดพลาด";

/* The error title. */
"AuthenticationErrorKey" = "ข้อผิดพลาดในการรับรองความถูกต้อง";

/* The error message for Touch ID devices. */
"AuthenticationTouchIDMessageKey" = "กรุณารับรองความถูกต้องโดยใช้ Touch ID เพื่อใช้แอพ";

/* The error message for Face ID devices. */
"AuthenticationFaceIDMessageKey" = "กรุณารับรองความถูกต้องโดยใช้ Face ID เพื่อใช้แอพ";

/* The authenticate button text. */
"AuthenticateKey" = "รับรองความถูกต้อง";

/* The message when the passcode entered in confirm passcode screen\n does not match with the one entered in the setup passcode screen. */
"PasscodeNotMatchKey" = "รหัสผ่านอุปกรณ์ไม่ตรงกัน กรุณาลองอีกครั้ง";

/* The message format to be displayed when user entered wrong passcode\n and the remaining number of retries is greater than 1. */
"AttemptsLeftKey" = "คุณพยายามได้อีก %d ครั้ง";

/* The message format to be displayed when user entered wrong passcode\n and there is only one remaining retry. */
"OneAttemptLeftKey" = "คุณพยายามได้อีก 1 ครั้ง";

/* The first paragraph of the alert message when the number user entered\n wrong passcode reached maximum allowed. */
"MaxAttemptsReachedKey" = "คุณพยายามครบจำนวนครั้งที่กำหนดแล้ว";

/* The second paragraph of the alert message when the number user entered\n wrong passcode reached maximum allowed. */
"EnterCredentialsKey" = "กรุณาลงชื่อเข้าใช้เพื่อรีเซ็ตรหัสผ่านอุปกรณ์";

/* The text of the dismiss button on the alert. */
"OKKey" = "ตกลง";

/* The message on the passcode screen when user entered wrong passcode\n and there is no limit on the number of retries. */
"RetryPasscodeKey" = "รหัสผ่านอุปกรณ์ไม่ถูกต้อง กรุณาลองอีกครั้ง";

/* The scan page title string. */
"ScanKey" = "สแกน";

/* The title of the pop-up message when user selected a QR code photo\n which did not have a valid QR code. */
"ScanUnsuccessfulKey" = "การสแกนไม่สำเร็จ";

/* The second line of the pop-up message when user selected a QR code photo\n which did not have a valid QR code. */
"SelectAnotherImageKey" = "กรุณาเลือกรูปภาพรหัส QR";

/* The title of the pop-up message when user successfully got a QR code for\n onboarding activation but this QR code was not recognized by system. */
"InvalidQRCodeKey" = "รหัส QR ไม่ถูกต้อง";

/* The second line of the pop-up message when user successfully got a QR code for\n onboarding activation but this QR code was not recognized by system. */
"QRCodeNotRecognizedKey" = "ไม่รู้จักรหัส QR";

/* The title of the alert to request photo access. */
"AllowPhotoAccessKey" = "อนุญาตให้เข้าถึงรูปถ่าย";

/* The message of the alert to request photo access. */
"GiveAccessToPhotoSettingsKey" = "เมื่อต้องการเลือกรูปภาพรหัส QR กรุณาให้สิทธิการเข้าถึงรูปถ่ายในการกำหนดค่าความเป็นส่วนตัวของอุปกรณ์ของคุณ";

/* The title of the alert to request camera access. */
"AllowCameraAccessKey" = "อนุญาตให้เข้าถึงกล้อง";

/* The message of the alert to request camera access. */
"GiveAccessToCameraSettingsKey" = "เมื่อต้องการสแกนโดยใช้กล้อง กรุณาให้สิทธิการเข้าถึงกล้องในการกำหนดค่าความเป็นส่วนตัวของอุปกรณ์ของคุณ";

/* *\n The alert action title to go to Settings app. */
"SettingsKey" = "การกำหนดค่า";

/* The title string for the QR code scan confirmation screen. */
"ConfirmationKey" = "การยืนยัน";

/* The success message for the QR code scan confirmation screen. */
"ScanSucceededKey" = "การสแกนทำได้สำเร็จ คุณจะเชื่อมต่อกับ:";

/* The title string for the \"Continue\" button */
"ContinueKey" = "ดำเนินการต่อ";

/* The title string for the back bar button on activation screen */
"BackBarButtonForActivationScreenKey" = "เปิดใช้";

/* FUIActivation Screen - headlineLabel */
"FUIActivationScreen_headlineLabel" = "การเปิดใช้งาน";

/* FUIActivation Screen - detailLabel */
"FUIActivationScreen_detailLabel" = "ถ้าคุณได้รับอีเมล์ต้อนรับ ให้ทำตามลิงก์การเปิดใช้งานในอีเมล์ หรือป้อนอีเมล์แอดเดรสของคุณหรือสแกนรหัส QR เพื่อเริ่มต้นการจัดเตรียมระบบ";

/* FUIActivation Screen - primaryActionButton Title */
"FUIActivationScreen_primaryActionButtonTitle" = "ถัดไป";

/* FUIActivation Screen - subheadlineLabel */
"FUIActivationScreen_subheadlineLabel" = "หรือ";

/* FUIActivation Screen - primaryActionButton Title */
"FUIActivationScreen_secondaryActionButtonTitle" = "สแกน";

/* FUIEULAView Screen - agree button */
"AgreeKey" = "ยอมรับ";

/* FUIEULAView Screen - disagree button */
"DisagreeKey" = "ไม่ยอมรับ";

/* The authentication title. */
"AuthenticationKey" = "การรับรองความถูกต้อง";

/* The basic authentication message. */
"basicAuthenticationMessageKey" = "กรุณาระบุชื่อผู้ใช้และรหัสผ่านของคุณเพื่อรับรองความถูกต้อง";

/* Username input field placeholder string */
"usernameKey" = "ชื่อผู้ใช้";

/* Password input field placeholder string */
"passwordKey" = "รหัสผ่าน";

/* Sign In button string. */
"SignInKey" = "ลงชื่อเข้าใช้";

/* Error message when failed to sign in. */
"SignInErrorKey" = "ข้อมูลประจำตัวไม่ถูกต้อง กรุณาลองอีกครั้ง";

/* The dynamic authentication message. */
"DynamicAuthenticationMessageKey" = "กรุณาระบุข้อมูลด้านล่างเพื่อเริ่มต้นกระบวนการเปิดใช้งาน";

/* The message displayed on the banner when verifying information user entered. */
"VerifyingMessageKey" = "กำลังตรวจสอบข้อมูล...";

/* Cancel button string. */
"CancelKey" = "ยกเลิก";

/* Allow button string. */
"AllowKey" = "อนุญาต";

/* Deny button string. */
"DenyKey" = "ปฏิเสธ";

/* No button string. */
"NoKey" = "ไม่ใช่";

/* Quit button string. */
"QuitKey" = "ออก";

/* GiveConsent button string. */
"GiveConsentKey" = "ให้ความยินยอม";

/* Navbar title string. */
"StepKey" = "ขั้นตอน";

/* Navbar title string. */
"OfKey" = "จาก";

/* CancelConfirmation message string. */
"CancelConfirmationKey" = "คุณแน่ใจหรือไม่ว่าต้องการออกจากกระบวนการจัดเตรียมระบบ?";

/* MandatoryMessage button string. */
"MandatoryMessageKey" = "หากไม่มีความยินยอม คุณจะไม่สามารถดำเนินการจัดเตรียมระบบต่อได้";

/* Switch User button string. */
"SwitchOrAddUserKey" = "สลับหรือเพิ่มผู้ใช้";

/* Title for Log In button */
"LogInKey" = "เข้าสู่ระบบ";

/* Placeholder text in search bar for searching users in multi-user login controller */
"SearchUsersKey" = "ค้นหาผู้ใช้ในอุปกรณ์นี้";

/* The button title for forgot passcode. */
"ForgotPasscodeKey" = "ลืมรหัสผ่านอุปกรณ์?";

/* Title for Loction */
"PNLoctionTitleKey" = "เปิดบริการบอกตำแหน่งเพื่อที่คุณจะสามารถใช้ฟีเจอร์แผนที่และการเนวิเกต";

/* Title for Notifications */
"PNNotificationsTitleKey" = "เปิดการแจ้งเพื่อที่คุณจะได้รับการแจ้งเตือนเกี่ยวกับประกาศสำคัญ";

/* Title for Photos */
"PNPhotosTitleKey" = "เปิดการเข้าถึงไลบรารีรูปถ่ายเพื่อที่คุณจะสามารถแชร์รูปถ่ายและเข้าถึงไลบรารีรูปถ่าย";

/* Title for Calendar */
"PNCalendarTitleKey" = "เปิดการเข้าถึงปฏิทินเพื่อที่คุณจะสามารถจองห้องและดูการประชุมของคุณ";

/* Title for Camera */
"PNCameraTitleKey" = "เปิดกล้องเพื่อที่คุณจะสามารถเข้าสู่ระบบและตรวจสอบโดยใช้ Face ID";

/* Subtitle for FUIPrivacyNoticeView */
"PNSubtitleKey" = "คุณสามารถเปลี่ยนแปลงสิทธินี้ภายหลังโดยใช้การกำหนดค่าแอพ";

/* FooterText for FUIPrivacyNoticeSettingsController */
"PNSettingsFooterTextKey" = "แอพพลิเคชันนี้ใช้สิทธิด้านล่างเพื่อให้คุณได้รับประสบการณ์ใช้งานที่ดีที่สุดที่เราจัดหาให้";

/* FooterText of Location for FUIPrivacyNoticeOpenSettingsController */
"PNOpenSettingsLocationFooterTextKey" = "อนุญาตให้แอพพลิเคชันเข้าถึงตำแหน่งที่ตั้งของคุณและแจ้งเตือนเมื่อคุณกำลังใช้แอพพลิเคชัน\n\nเมื่อต้องการกำหนดค่าหรือแก้ไขสิทธิของตำแหน่งที่ตั้ง ให้เปิดการกำหนดค่า iOS > แตะ \"Location\" > แตะ \"Application\" > เลือกการกำหนดค่าสิทธิของตำแหน่งที่ตั้งที่คุณต้องการ";

/* FooterText of Notifications for FUIPrivacyNoticeOpenSettingsController */
"PNOpenSettingsNotificationsFooterTextKey" = "อนุญาตให้แอพพลิเคชันเข้าถึงการแจ้งเตือนของคุณและแจ้งเตือนเมื่อคุณกำลังใช้แอพพลิเคชัน\n\nเมื่อต้องการกำหนดค่าหรือแก้ไขสิทธิของการแจ้งเตือน ให้เปิดการกำหนดค่า iOS > แตะ \"Notifications\" > แตะ \"Application\" > เลือกการกำหนดค่าสิทธิของการแจ้งเตือนที่คุณต้องการ";

/* FooterText of Photos for FUIPrivacyNoticeOpenSettingsController */
"PNOpenSettingsPhotosFooterTextKey" = "อนุญาตให้แอพพลิเคชันเข้าถึงรูปถ่ายของคุณและแจ้งเตือนเมื่อคุณกำลังใช้แอพพลิเคชัน\n\nเมื่อต้องการกำหนดค่าหรือแก้ไขสิทธิของรูปถ่าย ให้เปิดการกำหนดค่า iOS > แตะ \"Photos\" > แตะ \"Application\" > เลือกการกำหนดค่าสิทธิของรูปถ่ายที่คุณต้องการ";

/* FooterText of Camera for FUIPrivacyNoticeOpenSettingsController */
"PNOpenSettingsCameraFooterTextKey" = "อนุญาตให้แอพพลิเคชันเข้าถึงกล้องของคุณและแจ้งเตือนเมื่อคุณกำลังใช้แอพพลิเคชัน\n\nเมื่อต้องการกำหนดค่าหรือแก้ไขสิทธิของกล้อง ให้เปิดการกำหนดค่า iOS > แตะ \"Camera\" > แตะ \"Application\" > เลือกการกำหนดค่าสิทธิของกล้องที่คุณต้องการ";

/* FooterText of Calendar for FUIPrivacyNoticeOpenSettingsController */
"PNOpenSettingsCalendarFooterTextKey" = "อนุญาตให้แอพพลิเคชันเข้าถึงปฏิทินของคุณและแจ้งเตือนเมื่อคุณกำลังใช้แอพพลิเคชัน\n\nเมื่อต้องการกำหนดค่าหรือแก้ไขสิทธิของปฏิทิน ให้เปิดการกำหนดค่า iOS > แตะ \"Calendar\" > แตะ \"Application\" > เลือกการกำหนดค่าสิทธิของปฏิทินที่คุณต้องการ";

/* The button title for FUIPrivacyNoticeOpenSettingsController */
"PNOpenSettingKey" = "เปิดการกำหนดค่า iOS";

